
### Terraform Status default

#### Terraform Format and Style 🖌 `success`
#### Terraform Validate 📖 `success`
#### Terraform Plan 📖 `success`
<details>
<summary>Show Plan</summary>

```
 ...     = "metabase"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                           = {
          + "Name"                  = "metabase"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.metabase.module.alb.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for cluster01 application load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "cluster01-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                  = "metabase"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Name"                  = "metabase"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                 = (known after apply)
    }

  # module.metabase.module.alb.aws_vpc_security_group_egress_rule.this["all"] will be created
  + resource "aws_vpc_security_group_egress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"                  = "metabase"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Name"                  = "metabase"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
    }

  # module.metabase.module.alb.aws_vpc_security_group_ingress_rule.this["all_http"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"                  = "metabase"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Name"                  = "metabase"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + to_port                = 80
    }

  # module.metabase.module.autoscaling["pool1"].aws_autoscaling_group.idc[0] will be created
  + resource "aws_autoscaling_group" "idc" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 2
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 5
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = "cluster01-pool1-"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = true
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + termination_policies             = []
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "cluster01-pool1"
        }
      + tag {
          + key                 = "Repository"
          + propagate_at_launch = true
          + value               = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }

      + timeouts {}
    }

  # module.metabase.module.autoscaling["pool1"].aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "cluster01-"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all    = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + unique_id   = (known after apply)
    }

  # module.metabase.module.autoscaling["pool1"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EC2AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "ECS role for cluster01"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "cluster01-"
      + path                  = "/"
      + tags                  = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all              = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + unique_id             = (known after apply)
    }

  # module.metabase.module.autoscaling["pool1"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerServiceforEC2Role"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = (known after apply)
    }

  # module.metabase.module.autoscaling["pool1"].aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # module.metabase.module.autoscaling["pool1"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = (sensitive value)
      + instance_type          = "t3.micro"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "cluster01-pool1-"
      + tags                   = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + user_data              = "IyEvYmluL2Jhc2gKCmNhdCA8PCdFT0YnID4+IC9ldGMvZWNzL2Vjcy5jb25maWcKRUNTX0NMVVNURVI9Y2x1c3RlcjAxCkVDU19MT0dMRVZFTD1kZWJ1ZwpFQ1NfQ09OVEFJTkVSX0lOU1RBTkNFX1RBR1M9eyJOYW1lIjoibWV0YWJhc2UiLCJSZXBvc2l0b3J5IjoiaHR0cHM6Ly9naXRodWIuY29tL3RlcnJhZm9ybS1hd3MtbW9kdWxlcy90ZXJyYWZvcm0tYXdzLWVjcyJ9CkVDU19FTkFCTEVfVEFTS19JQU1fUk9MRT10cnVlCkVPRgo="
      + vpc_security_group_ids = (known after apply)

      + monitoring {
          + enabled = true
        }
    }

  # module.metabase.module.autoscaling_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Autoscaling group security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "cluster01-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.metabase.module.autoscaling_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "computed_ingress_with_source_security_group_id" {
      + description              = "Ingress Rule"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.metabase.module.autoscaling_sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.metabase.module.ecs_service.data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "cluster01"
      + task_role_arn        = (known after apply)
    }

  # module.metabase.module.ecs_service.data.aws_subnet.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = (known after apply)
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + available_ip_address_count                     = (known after apply)
      + cidr_block                                     = (known after apply)
      + customer_owned_ipv4_pool                       = (known after apply)
      + default_for_az                                 = (known after apply)
      + enable_dns64                                   = (known after apply)
      + enable_lni_at_device_index                     = (known after apply)
      + enable_resource_name_dns_a_record_on_launch    = (known after apply)
      + enable_resource_name_dns_aaaa_record_on_launch = (known after apply)
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = (known after apply)
      + map_customer_owned_ip_on_launch                = (known after apply)
      + map_public_ip_on_launch                        = (known after apply)
      + outpost_arn                                    = (known after apply)
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + state                                          = (known after apply)
      + tags                                           = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.metabase.module.ecs_service.aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.metabase.module.ecs_service.aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.metabase.module.ecs_service.aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = (known after apply)
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags               = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all           = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.metabase.module.ecs_service.aws_ecs_service.this[0] will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 66
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "cluster01"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                           = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "pool1"
          + weight            = 1
        }

      + load_balancer {
          + container_name   = "ecs-sample"
          + container_port   = 8888
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + timeouts {}
    }

  # module.metabase.module.ecs_service.aws_ecs_task_definition.this[0] will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment            = []
                  + image                  = "public.ecr.aws/ecs-sample-image/amazon-ecs-sample:latest"
                  + interactive            = false
                  + linuxParameters        = {
                      + initProcessEnabled = false
                    }
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/cluster01/ecs-sample"
                          + awslogs-region        = "sa-east-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + mountPoints            = [
                      + {
                          + containerPath = "/var/www/my-vol"
                          + sourceVolume  = "my-vol"
                        },
                    ]
                  + name                   = "ecs-sample"
                  + portMappings           = [
                      + {
                          + containerPort = 8888
                          + name          = "ecs-sample"
                          + protocol      = "tcp"
                        },
                    ]
                  + privileged             = false
                  + pseudoTerminal         = false
                  + readonlyRootFilesystem = false
                  + startTimeout           = 30
                  + stopTimeout            = 120
                  + systemControls         = []
                  + user                   = "0"
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "cluster01"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "EC2",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                 = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }

      + volume {
          + name = "my-vol"
        }
    }

  # module.metabase.module.ecs_service.aws_iam_policy.task_exec[0] will be created
  + resource "aws_iam_policy" "task_exec" {
      + arn         = (known after apply)
      + description = "Task execution role IAM policy"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "cluster01-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "Logs"
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECR"
                    },
                  + {
                      + Action   = "ssm:GetParameters"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:*:*:parameter/*"
                      + Sid      = "GetSSMParams"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:*:*:secret:*"
                      + Sid      = "GetSecrets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all    = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.metabase.module.ecs_service.aws_iam_role.task_exec[0] will be created
  + resource "aws_iam_role" "task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTaskExecutionAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Task execution role for cluster01"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "cluster01-"
      + path                  = "/"
      + tags                  = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all              = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + unique_id             = (known after apply)
    }

  # module.metabase.module.ecs_service.aws_iam_role.tasks[0] will be created
  + resource "aws_iam_role" "tasks" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnLike      = {
                              + "aws:SourceArn" = "arn:aws:ecs:sa-east-1:905418314539:*"
                            }
                          + StringEquals = {
                              + "aws:SourceAccount" = "905418314539"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTasksAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "cluster01-"
      + path                  = "/"
      + tags                  = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all              = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + unique_id             = (known after apply)
    }

  # module.metabase.module.ecs_service.aws_iam_role_policy_attachment.task_exec[0] will be created
  + resource "aws_iam_role_policy_attachment" "task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.metabase.module.ecs_service.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "cluster01-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"       = "cluster01"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Name"       = "cluster01"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                 = (known after apply)
    }

  # module.metabase.module.ecs_service.aws_security_group_rule.this["alb_http_ingress"] will be created
  + resource "aws_security_group_rule" "this" {
      + description              = "Service port"
      + from_port                = 8888
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8888
      + type                     = "ingress"
    }

  # module.metabase.module.rds_security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Autoscaling group security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "cluster01-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.metabase.module.rds_security_group.aws_security_group_rule.computed_ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "computed_ingress_with_source_security_group_id" {
      + description              = "Ingress Rule"
      + from_port                = 5432
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.metabase.module.rds_security_group.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.metabase.module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.metabase.module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.metabase.module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                 = (known after apply)
    }

  # module.metabase.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all             = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc                  = (known after apply)
    }

  # module.metabase.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id   = (known after apply)
    }

  # module.metabase.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                           = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.metabase.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.metabase.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.metabase.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all         = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id           = (known after apply)
    }

  # module.metabase.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all         = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id           = (known after apply)
    }

  # module.metabase.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.metabase.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.metabase.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.metabase.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.metabase.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.metabase.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.metabase.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "sa-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.metabase.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "sa-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.metabase.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "sa-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.metabase.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "sa-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.48.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.metabase.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "sa-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.49.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.metabase.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "sa-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.50.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.metabase.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                             = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.metabase.module.db_default.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 0
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-06:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "metabase"
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = "cluster01-default-"
      + instance_class                        = "db.t4g.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:00:00-mon:03:00"
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                              = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + timezone                              = (known after apply)
      + username                              = "complete_postgresql"
      + vpc_security_group_ids                = (known after apply)

      + timeouts {}
    }

  # module.metabase.module.db_default.module.db_instance.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id" = "cluster01-default"
        }
    }

  # module.metabase.module.ecs_cluster.module.cluster.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/cluster01"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all          = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.metabase.module.ecs_cluster.module.cluster.aws_ecs_capacity_provider.this["pool1"] will be created
  + resource "aws_ecs_capacity_provider" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "pool1"
      + tags     = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_draining               = (known after apply)
          + managed_termination_protection = "ENABLED"

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 5
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 60
            }
        }
    }

  # module.metabase.module.ecs_cluster.module.cluster.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "cluster01"
      + tags     = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "DEFAULT"
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.metabase.module.ecs_cluster.module.cluster.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "pool1",
        ]
      + cluster_name       = "cluster01"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 20
          + capacity_provider = "pool1"
          + weight            = 60
        }
    }

  # module.metabase.module.ecs_service.module.container_definition["ecs-sample"].aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/cluster01/ecs-sample"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all          = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

Plan: 59 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - account_id  = "905418314539" -> null
  - caller_arn  = "arn:aws:iam::905418314539:root" -> null
  - caller_user = "905418314539" -> null
  + dns_name    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
Output is too long and was truncated. You can read full Plan in <a href="https://github.com/coolcolden/metabase-cd-aws/actions/runs/8605632401">Actions</a>.<br /><br />

Pusher: @coolcolden
Action: `pull_request`
